In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('adult.csv')#Reading the CSV file

In [3]:
df.head()#Display the first five rows

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [4]:
print('the shape:',df.shape)

the shape: (48842, 15)

In [5]:
#some general information about the data frame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [6]:
#basic statistical characteristics of each numerical feature
df.describe()

,age,fnlwgt,educational-num,capital-gain,capital-loss,hours-per-week
count,48842.000000,4.884200e+04,48842.000000,48842.000000,48842.000000,48842.000000
mean,38.643585,1.896641e+05,10.078089,1079.067626,87.502314,40.422382
std,13.710510,1.056040e+05,2.570973,7452.019058,403.004552,12.391444
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.175505e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.781445e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.376420e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.490400e+06,16.000000,99999.000000,4356.000000,99.000000

In [7]:
#for Nun-numerical
df.describe(include=object)

,workclass,education,marital-status,occupation,relationship,race,gender,native-country,income
count,48842,48842,48842,48842,48842,48842,48842,48842,48842
unique,9,16,7,15,6,5,2,42,2
top,Private,HS-grad,Married-civ-spouse,Prof-specialty,Husband,White,Male,United-States,<=50K
freq,33906,15784,22379,6172,19716,41762,32650,43832,37155

In [8]:
#perform data cleaning
df.isin(['?']).sum()

age                   0
workclass          2799
fnlwgt                0
education             0
educational-num       0
marital-status        0
occupation         2809
relationship          0
race                  0
gender                0
capital-gain          0
capital-loss          0
hours-per-week        0
native-country      857
income                0
dtype: int64

In [9]:
df['workclass']=df['workclass'].replace('?',np.nan)
df['occupation']=df['occupation'].replace('?',np.nan)
df['native-country']=df['native-country'].replace('?',np.nan)

In [10]:
df.isnull().sum()

age                   0
workclass          2799
fnlwgt                0
education             0
educational-num       0
marital-status        0
occupation         2809
relationship          0
race                  0
gender                0
capital-gain          0
capital-loss          0
hours-per-week        0
native-country      857
income                0
dtype: int64

In [11]:
df.dropna(how='any',inplace=True,axis=0)

In [12]:
df.isnull().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [13]:
#check for Duplicate data and drop them
dup = df.duplicated().any()
print('are there any duplicated data ?',dup)

are there any duplicated data ? True

In [14]:
df.drop_duplicates(inplace=True)

In [15]:
dup = df.duplicated().any()
print('are there any duplicated data ?',dup)

are there any duplicated data ? False

In [16]:
#calculate the average age
average_age = df['age'].mean()
print(average_age)

38.55617044825678

In [17]:
#sort the age column
df.sort_values(by='age')
#we can see that the minimum age is 17 and Maximum age is 90

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
24938,17,Private,294485,10th,6,Never-married,Other-service,Own-child,White,Male,0,0,30,United-States,<=50K
9826,17,Private,226503,11th,7,Never-married,Sales,Own-child,White,Female,0,0,20,United-States,<=50K
40816,17,Private,193748,11th,7,Never-married,Sales,Own-child,White,Male,0,0,15,United-States,<=50K
17759,17,Private,197850,11th,7,Never-married,Adm-clerical,Own-child,Asian-Pac-Islander,Female,0,0,24,United-States,<=50K
48240,17,Private,24090,HS-grad,9,Never-married,Exec-managerial,Own-child,White,Female,0,0,35,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6976,90,Private,250832,HS-grad,9,Married-civ-spouse,Transport-moving,Husband,White,Male,2414,0,40,United-States,<=50K
40324,90,Self-emp-not-inc,82628,HS-grad,9,Never-married,Exec-managerial,Not-in-family,White,Male,2964,0,12,United-States,<=50K
19172,90,Private,171956,Some-college,10,Separated,Adm-clerical,Own-child,White,Female,0,0,40,Puerto-Rico,<=50K
26826,90,Private,175491,HS-grad,9,Married-civ-spouse,Craft-repair,Husband,White,Male,9386,0,50,Ecuador,>50K
48648,90,Local-gov,214594,7th-8th,4,Married-civ-spouse,Protective-serv,Husband,White,Male,2653,0,40,United-States,<=50K

In [18]:
df

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
5,34,Private,198693,10th,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48837,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
48838,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
48839,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
48840,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
48841,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [19]:
#The most common age
unique = df['age'].unique()
unique

array([25, 38, 28, 44, 34, 63, 24, 55, 65, 36, 26, 48, 43, 20, 37, 45, 22,
       23, 54, 32, 46, 56, 17, 29, 39, 52, 18, 21, 42, 33, 30, 47, 41, 19,
       69, 50, 31, 59, 49, 58, 40, 27, 57, 61, 51, 73, 53, 80, 62, 35, 72,
       64, 68, 66, 60, 67, 71, 70, 90, 77, 81, 74, 78, 82, 75, 85, 76, 89,
       83, 79, 88, 87, 84, 86])

In [20]:
counts = df['age'].value_counts().sort_values(ascending=False)
counts

36    1283
33    1279
31    1273
35    1271
23    1237
      ...
85       5
88       5
89       1
87       1
86       1
Name: age, Length: 74, dtype: int64

In [21]:
print('the most common age is: ',counts.index[counts.argmax()])

the most common age is:  36

In [22]:
total_count = counts.sum()
total_of_36 = counts.max()
#the percentage equation (total of 36 /total count)*100
percentage_of_36 = (total_of_36/total_count)*100
print('the Percentage of 36 is: ',percentage_of_36,'%')

the Percentage of 36 is:  2.840066408411732 %

In [23]:
def types_of(column):
    print('the '+column+' types')
    unique = df[column].unique()
    print(unique)
    print('we have',len(unique),'types of '+column)
    for i in unique:
        print(i)
    print('\nthe most common '+column)
    counts = df[column].value_counts().sort_values(ascending=False)
    print(counts)
    print('the most Common '+column+' is',counts.idxmax())
    print('\nThe percentage for each of '+column)
    percentage = [(x/counts.sum())*100 for x in counts]
    for x,y in zip(counts.keys(),percentage):
        print(x,'('+str(y)+' %'+')')

In [24]:
#the workclass types
types_of('workclass')

the workclass types
['Private' 'Local-gov' 'Self-emp-not-inc' 'Federal-gov' 'State-gov'
 'Self-emp-inc' 'Without-pay']
we have 7 types of workclass
Private
Local-gov
Self-emp-not-inc
Federal-gov
State-gov
Self-emp-inc
Without-pay

the most common workclass
Private             33262
Self-emp-not-inc     3795
Local-gov            3100
State-gov            1946
Self-emp-inc         1645
Federal-gov          1406
Without-pay            21
Name: workclass, dtype: int64
the most Common workclass is Private

The percentage for each of workclass
Private (73.62921970116216 %)
Self-emp-not-inc (8.400664084117322 %)
Local-gov (6.862202545655784 %)
State-gov (4.3076923076923075 %)
Self-emp-inc (3.641394576646375 %)
Federal-gov (3.1123408965135586 %)
Without-pay (0.04648588821250692 %)

In [25]:
#the education types
types_of('education')

the education types
['11th' 'HS-grad' 'Assoc-acdm' 'Some-college' '10th' 'Prof-school'
 '7th-8th' 'Bachelors' 'Masters' '5th-6th' 'Assoc-voc' '9th' 'Doctorate'
 '12th' '1st-4th' 'Preschool']
we have 16 types of education
11th
HS-grad
Assoc-acdm
Some-college
10th
Prof-school
7th-8th
Bachelors
Masters
5th-6th
Assoc-voc
9th
Doctorate
12th
1st-4th
Preschool

the most common education
HS-grad         14770
Some-college     9887
Bachelors        7559
Masters          2513
Assoc-voc        1958
11th             1619
Assoc-acdm       1507
10th             1223
7th-8th           822
Prof-school       785
9th               676
12th              575
Doctorate         544
5th-6th           447
1st-4th           220
Preschool          70
Name: education, dtype: int64
the most Common education is HS-grad

The percentage for each of education
HS-grad (32.6950747094632 %)
Some-college (21.885998893193136 %)
Bachelors (16.732706142778085 %)
Masters (5.562811289429995 %)
Assoc-voc (4.3342556723851695 %)
11th (3.5838406198118427 %)
Assoc-acdm (3.3359158826784725 %)
10th (2.7072495849474265 %)
7th-8th (1.8195904814609851 %)
Prof-school (1.7376867736579968 %)
9th (1.4964028776978417 %)
12th (1.2728278915329274 %)
Doctorate (1.2042058660763697 %)
5th-6th (0.9894853348090757 %)
1st-4th (0.4869950193691201 %)
Preschool (0.1549529607083564 %)

In [26]:
#the occupation types
types_of('occupation')

the occupation types
['Machine-op-inspct' 'Farming-fishing' 'Protective-serv' 'Other-service'
 'Prof-specialty' 'Craft-repair' 'Adm-clerical' 'Exec-managerial'
 'Tech-support' 'Sales' 'Priv-house-serv' 'Transport-moving'
 'Handlers-cleaners' 'Armed-Forces']
we have 14 types of occupation
Machine-op-inspct
Farming-fishing
Protective-serv
Other-service
Prof-specialty
Craft-repair
Adm-clerical
Exec-managerial
Tech-support
Sales
Priv-house-serv
Transport-moving
Handlers-cleaners
Armed-Forces

the most common occupation
Craft-repair         6010
Prof-specialty       6001
Exec-managerial      5980
Adm-clerical         5535
Sales                5405
Other-service        4805
Machine-op-inspct    2965
Transport-moving     2316
Handlers-cleaners    2045
Farming-fishing      1475
Tech-support         1419
Protective-serv       975
Priv-house-serv       230
Armed-Forces           14
Name: occupation, dtype: int64
the most Common occupation is Craft-repair

The percentage for each of occupation
Craft-repair (13.303818483674599 %)
Prof-specialty (13.283895960154954 %)
Exec-managerial (13.237410071942445 %)
Adm-clerical (12.25235196458218 %)
Sales (11.964582180409518 %)
Other-service (10.636413945766463 %)
Machine-op-inspct (6.563364692861096 %)
Transport-moving (5.126729385722192 %)
Handlers-cleaners (4.526840066408411 %)
Farming-fishing (3.26508024349751 %)
Tech-support (3.1411178749308246 %)
Protective-serv (2.158273381294964 %)
Priv-house-serv (0.509131156613171 %)
Armed-Forces (0.03099059214167128 %)

In [27]:
#the relationship types
types_of('relationship')

the relationship types
['Own-child' 'Husband' 'Not-in-family' 'Unmarried' 'Wife' 'Other-relative']
we have 6 types of relationship
Own-child
Husband
Not-in-family
Unmarried
Wife
Other-relative

the most common relationship
Husband           18653
Not-in-family     11679
Own-child          6616
Unmarried          4787
Wife               2091
Other-relative     1349
Name: relationship, dtype: int64
the most Common relationship is Husband

The percentage for each of relationship
Husband (41.29053680132817 %)
Not-in-family (25.852794687327062 %)
Own-child (14.645268400664085 %)
Unmarried (10.596568898727172 %)
Wife (4.628666297731046 %)
Other-relative (2.986164914222468 %)

In [28]:
#the race types
types_of('race')

the race types
['Black' 'White' 'Other' 'Amer-Indian-Eskimo' 'Asian-Pac-Islander']
we have 5 types of race
Black
White
Other
Amer-Indian-Eskimo
Asian-Pac-Islander

the most common race
White                 38859
Black                  4227
Asian-Pac-Islander     1301
Amer-Indian-Eskimo      435
Other                   353
Name: race, dtype: int64
the most Common race is White

The percentage for each of race
White (86.01881571665744 %)
Black (9.356945213060321 %)
Asian-Pac-Islander (2.879911455451024 %)
Amer-Indian-Eskimo (0.9629219701162147 %)
Other (0.7814056447149973 %)

In [29]:
#the gender types
types_of('gender')

the gender types
['Male' 'Female']
we have 2 types of gender
Male
Female

the most common gender
Male      30495
Female    14680
Name: gender, dtype: int64
the most Common gender is Male

The percentage for each of gender
Male (67.50415052573327 %)
Female (32.49584947426674 %)

In [30]:
#the native-country types
types_of('native-country')

the native-country types
['United-States' 'Peru' 'Guatemala' 'Mexico' 'Dominican-Republic'
 'Ireland' 'Germany' 'Philippines' 'Thailand' 'Haiti' 'El-Salvador'
 'Puerto-Rico' 'Vietnam' 'South' 'Columbia' 'Japan' 'India' 'Cambodia'
 'Poland' 'Laos' 'England' 'Cuba' 'Taiwan' 'Italy' 'Canada' 'Portugal'
 'China' 'Nicaragua' 'Honduras' 'Iran' 'Scotland' 'Jamaica' 'Ecuador'
 'Yugoslavia' 'Hungary' 'Hong' 'Greece' 'Trinadad&Tobago'
 'Outlying-US(Guam-USVI-etc)' 'France' 'Holand-Netherlands']
we have 41 types of native-country
United-States
Peru
Guatemala
Mexico
Dominican-Republic
Ireland
Germany
Philippines
Thailand
Haiti
El-Salvador
Puerto-Rico
Vietnam
South
Columbia
Japan
India
Cambodia
Poland
Laos
England
Cuba
Taiwan
Italy
Canada
Portugal
China
Nicaragua
Honduras
Iran
Scotland
Jamaica
Ecuador
Yugoslavia
Hungary
Hong
Greece
Trinadad&Tobago
Outlying-US(Guam-USVI-etc)
France
Holand-Netherlands

the most common native-country
United-States                 41256
Mexico                          895
Philippines                     282
Germany                         193
Puerto-Rico                     175
Canada                          163
El-Salvador                     147
India                           147
Cuba                            133
England                         119
China                           113
Jamaica                         103
South                           101
Italy                           100
Dominican-Republic               97
Japan                            89
Guatemala                        84
Vietnam                          83
Columbia                         82
Poland                           81
Haiti                            69
Portugal                         62
Iran                             56
Taiwan                           55
Greece                           49
Nicaragua                        48
Peru                             45
Ecuador                          43
France                           36
Ireland                          36
Thailand                         29
Hong                             28
Cambodia                         26
Trinadad&Tobago                  26
Yugoslavia                       23
Outlying-US(Guam-USVI-etc)       22
Laos                             21
Scotland                         20
Honduras                         19
Hungary                          18
Holand-Netherlands                1
Name: native-country, dtype: int64
the most Common native-country is United-States

The percentage for each of native-country
United-States (91.32484781405644 %)
Mexico (1.9811842833425568 %)
Philippines (0.6242390702822357 %)
Germany (0.4272274488101826 %)
Puerto-Rico (0.387382401770891 %)
Canada (0.36081903707802987 %)
El-Salvador (0.3254012174875484 %)
India (0.3254012174875484 %)
Cuba (0.29441062534587714 %)
England (0.2634200332042059 %)
China (0.2501383508577753 %)
Jamaica (0.22800221361372439 %)
South (0.22357498616491422 %)
Italy (0.22136137244050913 %)
Dominican-Republic (0.21472053126729385 %)
Japan (0.19701162147205314 %)
Guatemala (0.18594355285002767 %)
Vietnam (0.18372993912562258 %)
Columbia (0.18151632540121748 %)
Poland (0.17930271167681242 %)
Haiti (0.1527393469839513 %)
Portugal (0.13724405091311567 %)
Iran (0.12396236856668512 %)
Taiwan (0.12174875484228002 %)
Greece (0.10846707249584947 %)
Nicaragua (0.10625345877144439 %)
Peru (0.09961261759822912 %)
Ecuador (0.09518539014941893 %)
France (0.07969009407858328 %)
Ireland (0.07969009407858328 %)
Thailand (0.06419479800774765 %)
Hong (0.06198118428334256 %)
Cambodia (0.05755395683453237 %)
Trinadad&Tobago (0.05755395683453237 %)
Yugoslavia (0.0509131156613171 %)
Outlying-US(Guam-USVI-etc) (0.048699501936912006 %)
Laos (0.04648588821250692 %)
Scotland (0.04427227448810182 %)
Honduras (0.042058660763696736 %)
Hungary (0.03984504703929164 %)
Holand-Netherlands (0.002213613724405091 %)

In [31]:
#the income types
types_of('income')

the income types
['<=50K' '>50K']
we have 2 types of income
<=50K
>50K

the most common income
<=50K    33973
>50K     11202
Name: income, dtype: int64
the most Common income is <=50K

The percentage for each of income
<=50K (75.20309905921417 %)
>50K (24.796900940785832 %)

In [32]:
#the average hours per week
average_hours_per_week = df['hours-per-week'].mean()
average_age

38.55617044825678

In [33]:
#Average age for each education
df[['education','age']].groupby('education').mean()

                    age
education
10th          38.138185
11th          32.205065
12th          32.645217
1st-4th       45.313636
5th-6th       42.570470
7th-8th       48.753041
9th           40.319527
Assoc-acdm    37.653616
Assoc-voc     38.350868
Bachelors     38.654452
Doctorate     47.064338
HS-grad       38.791740
Masters       43.729009
Preschool     41.671429
Prof-school   44.761783
Some-college  36.144938

In [34]:
#Average age for each workclass
df[['workclass','age']].groupby('workclass').mean()

                        age
workclass
Federal-gov       42.593172
Local-gov         41.651290
Private           36.898262
Self-emp-inc      45.821277
Self-emp-not-inc  45.366271
State-gov         39.530319
Without-pay       47.285714

In [35]:
#Highest income working class
condition = df['income'] == '>50K'
condition

0        False
1        False
2         True
3         True
5        False
         ...
48837    False
48838     True
48839    False
48840    False
48841     True
Name: income, Length: 45175, dtype: bool

In [36]:
df['workclass'][condition]

2               Local-gov
3                 Private
7        Self-emp-not-inc
10                Private
14                Private
               ...
48819             Private
48826           Local-gov
48835             Private
48838             Private
48841        Self-emp-inc
Name: workclass, Length: 11202, dtype: object

In [37]:
unique = df['workclass'][condition].unique()
unique

array(['Local-gov', 'Private', 'Self-emp-not-inc', 'State-gov',
       'Self-emp-inc', 'Federal-gov', 'Without-pay'], dtype=object)

In [38]:
counts = df['workclass'][condition].value_counts().sort_values(ascending=False)
counts

Private             7245
Self-emp-not-inc    1059
Local-gov            915
Self-emp-inc         912
Federal-gov          549
State-gov            520
Without-pay            2
Name: workclass, dtype: int64

In [39]:
print('Highest income working class')
print(counts)

Highest income working class
Private             7245
Self-emp-not-inc    1059
Local-gov            915
Self-emp-inc         912
Federal-gov          549
State-gov            520
Without-pay            2
Name: workclass, dtype: int64

In [40]:
#how has better income
condition = df['income'] == '>50K'
condition

0        False
1        False
2         True
3         True
5        False
         ...
48837    False
48838     True
48839    False
48840    False
48841     True
Name: income, Length: 45175, dtype: bool

In [41]:
df['gender'][condition]

2          Male
3          Male
7          Male
10         Male
14         Male
          ...
48819    Female
48826    Female
48835      Male
48838      Male
48841    Female
Name: gender, Length: 11202, dtype: object

In [42]:
unique = df['gender'][condition].unique()
unique

array(['Male', 'Female'], dtype=object)

In [43]:
counts = df['gender'][condition].value_counts().sort_values(ascending=False)
counts

Male      9533
Female    1669
Name: gender, dtype: int64

In [44]:
print('Highest income working class')
print(counts)

Highest income working class
Male      9533
Female    1669
Name: gender, dtype: int64